In [31]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

# Pandas Ünitesi Ödev 1

In [38]:
df = pd.DataFrame({'asal':  [2, 3, 5, 7, 11, 13, 17, 19, 23, 29],
                   'fibonacci' : [0, 1, 1, 2, 3, 5, 8, 13, 21, 34]
                    })

df.index=('a', 'b', 'c', 'ç', 'd','e','f','g','g','h')
df

   asal  fibonacci
a     2          0
b     3          1
c     5          1
ç     7          2
d    11          3
e    13          5
f    17          8
g    19         13
g    23         21
h    29         34

# Pandas Ünitesi Ödev 2

titanic = pd.read_csv('train.csv')
titanic

In [8]:
df = pd.DataFrame({'Ad' : ['İstanbul', 'Ankara', 'İzmir', 'Bursa', 'Antalya'],
                   'Nüfus':  [15029231, 5445026, 4279677, 2936803, 2364396],
                   'Kod' : ['34', '06', '35', '16', '07']
                  })
df

         Ad     Nüfus Kod
0  İstanbul  15029231  34
1    Ankara   5445026  06
2     İzmir   4279677  35
3     Bursa   2936803  16
4   Antalya   2364396  07

In [8]:
df = pd.DataFrame({'Ad' : ['İstanbul', 'Ankara', 'İzmir', 'Bursa', 'Antalya'],
                   'Nüfus':  [15029231, 5445026, 4279677, 2936803, 2364396],
                   'Kod' : ['34', '06', '35', '16', '07']
                  })
df

         Ad     Nüfus Kod
0  İstanbul  15029231  34
1    Ankara   5445026  06
2     İzmir   4279677  35
3     Bursa   2936803  16
4   Antalya   2364396  07

In [44]:
titanic.groupby('Sex').mean()['Age']

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

# Pandas Ünitesi Ödev 3

In [50]:
titanic[titanic['Age']<30].groupby('Sex').mean()['Survived']

Sex
female    0.714286
male      0.215190
Name: Survived, dtype: float64